import io
import sys

_INPUT = """\
8 4
3 1 4 1 5 9 2 6
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# マスの移動 (2)
# ますの移動がM通りある場合→２重ループで１つのマスに対して複数のマスからの移動をチェックして更新していく
# ---------------------------------------------------------------------------------------------------------

# 無限大を表す値 (1000000 にしておく)
INF = 1000000

# 入力
N, M = map(int, input().split())
A = list(map(int, input().split()))


dp = [INF] * N
dp[0] = 0

for i in range(1, N):
    for m in range(1, M + 1):
        if i - m >= 0:
            dp[i] = min(dp[i], dp[i - m] + A[i] * m)

print(dp[-1])
