# １次元の累積和
# 配列の長さに注意
# 最終日も-1できるように配列作る。

import io
import sys

_INPUT = """\
8
5
2 3
3 6
5 7
3 8
1 5
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 累積和　cumulative
# 前日比を記録　マイナスするのは+1日目
# ---------------------------------------------------------------------------------------------------------

D = int(input())
N = int(input())

A = [0] * (D + 2)
for i in range(N):
    L, R = map(int, input().split())
    A[L] += 1
    A[R + 1] -= 1

ans = [0] * (D + 2)
for i in range(1, D + 1):
    ans[i] = ans[i - 1] + A[i]
    print(ans[i])
