import io
import sys

_INPUT = """\
5
1 2
1 3
1 4
5 3
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 木とは、n 個の頂点と、それら全てを連結する n-1 個の辺からなるグラフのことです。
# N=5　だと　辺は４つになる
# ---------------------------------------------------------------------------------------------------------

N = int(input())

G = [[0 for i in range(N)] for i in range(N)]

for i in range(N - 1):
    a, b = map(int, input().split())
    G[a - 1][b - 1] = 1
    G[b - 1][a - 1] = 1


for i in range(N):
    print(*G[i], sep=" ")
