import io
import sys

_INPUT = """\
1
back
black
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 解説AC
# 挿入と削除が同じとこまでは問題文読んでわかったが、文末から削除していくのに気付けなかった
# ---------------------------------------------------------------------------------------------------------

N = int(input())
S = list(input())
T = list(input())

for _ in range(2):
    # 末尾から文字列を削除→先頭から削除のために、for文を2回回す
    while len(S) and len(T) and S[-1] == T[-1]:
        S.pop()
        T.pop()
    # 後ろから削除しきったら、逆順にする
    S = S[::-1]
    T = T[::-1]

if len(S) <= 1 and len(T) <= 1:
    # 1文字以下になったら「変更」か「挿入or削除」を行えばOKなのでYes
    print("Yes")
else:
    print("No")
