import io
import sys

_INPUT = """\
999073936 4

"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# 四捨五入　rount()は５も切り捨てになってしまうため使えない
# 下桁から四捨五入していく
# もうこの計算式で覚えるのが楽かも
# https://atcoder.jp/contests/abc273/editorial/5060
# x を y で割った値の切り上げ ⌈x/y⌉ を (x + y - 1) / y と書くのは比較的有名・頻出ですが、これと同じ発想です。
# ---------------------------------------------------------------------------------------------------------

X, K = map(int, input().split())


tmp = X

for i in range(0, K):
    tmp = int((tmp + 5 * 10**i) / 10 ** (i + 1)) * 10 ** (i + 1)
print(tmp)
