import io
import sys

_INPUT = """\
15
"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# https://atcoder.jp/contests/abc139/tasks/abc139_d
# あまりの最大化{1, 2, 3,..., N}を一つずらして{N, 1, 2,..., N - 1}という数列を作るのが最適です。
# こうするとN % 1 + 1 % 2 + 2 % 3 + ... + (N - 1) % Nのように初項以外すべてで最も効率のいい「割る数 - 1」の余りが取れるわけです。
# ---------------------------------------------------------------------------------------------------------
n = int(input())

print((n - 1) * n // 2)

# *****************************************
# n = int(input())
# for i in range(n):
#     a += i
# print(a)
# *******************************************
#
