import io
import sys

_INPUT = """\
100000

"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# ８進数 変換 oct()
# 1 以上 N 以下の整数のうち、10 進法で表しても 8 進法で表しても 7 を含まないような数はいくつありますか？
# ---------------------------------------------------------------------------------------------------------
n = int(input())
target = "7"

ans = 0

for i in range(1, n + 1):
    s = str(i)
    if target not in s and target not in str(oct(i)):
        ans += 1

print(ans)
