import io
import sys

_INPUT = """\
0 3 1 5

"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# これは区間 [L 1 ,R1 ] と [L2​ ,R 2​ ] の共通区間の長さを求めよという問題です。
# 答えは max(0,min(r1,r2) - max(l1,l2)) で求める事ができる。
# ---------------------------------------------------------------------------------------------------------

l1, r1, l2, r2 = map(int, input().split())

ans = 0

for i in range(l1, r1):
    for j in range(l2, r2):
        if i == j:
            ans += 1
print(ans)

# -------------------------------------------

print(max(0, min(r1, r2) - max(l1, l2)))

# -----------------------------------

if l1 > l2:
    l1, r1, l2, r2 = l2, r2, l1, r1
if r1 <= l2:
    print(0)
elif r1 <= r2:
    print(r1 - l2)
else:
    print(r2 - l2)
