import io
import sys

_INPUT = """\
15 30
6 9
9 10
2 9
9 12
2 14
1 4
4 6
1 3
4 14
1 6
9 11
2 6
3 9
5 9
4 9
11 15
1 13
4 13
8 9
9 13
5 15
3 5
8 10
2 4
9 14
1 9
2 8
6 13
7 9
9 15

"""
sys.stdin = io.StringIO(_INPUT)

# ---------------------------------------------------------------------------------------------------------
# グラフ　隣接リスト表現
# 変が最多の点を出力
# ---------------------------------------------------------------------------------------------------------

n, m = map(int, input().split())

g = [[] for _ in range(n + 1)]

for i in range(m):
    a, b = map(int, input().split())
    g[a].append(b)
    g[b].append(a)

ans = 0

for i in range(1, n + 1):
    if len(g[ans]) < len(g[i]):
        ans = i

print(ans)


# ---------------------------------------------------------------------------------------------------------
# 模範解答
# ---------------------------------------------------------------------------------------------------------

# 入力
N, M = map(int, input().split())

# 友達の数を数える
friend = [0] * N
for _ in range(M):
    A, B = map(int, input().split())
    A -= 1
    B -= 1
    friend[A] += 1
    friend[B] += 1

mx = max(friend)
ans = friend.index(mx)
print(ans + 1)
